---
kind: property
id: P:Autodesk.Revit.DB.Material.StructuralAssetId
zh: 材质、材料
source: html/9b6f4d74-4c3b-06cc-874c-176758d305db.htm
---
# Autodesk.Revit.DB.Material.StructuralAssetId Property

**中文**: 材质、材料

The ElementId of the structural PropertySetElement.

## Syntax (C#)
```csharp
public ElementId StructuralAssetId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null